[Killed] BlockStatement
jest-path-bug/src/@$_(ok)/my-lib.ts:1:23
-const square = (a) => {
-  if (!a) return 0;
-  
-  return a * a;
-}
+const square = (a) => {}
 
 module.exports = square
killedBy: Square method should return right value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
jest-path-bug/src/@$_(ok)/my-lib.ts:2:7
 const square = (a) => {
-  if (!a) return 0;
+  if (true) return 0;
   
   return a * a;
killedBy: Square method should return right value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
jest-path-bug/src/@$_(ok)/my-lib.ts:2:7
 const square = (a) => {
-  if (!a) return 0;
+  if (a) return 0;
   
   return a * a;
killedBy: Square method should return right value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
jest-path-bug/src/@$_(ok)/my-lib.ts:4:10
 const square = (a) => {
   if (!a) return 0;
   
-  return a * a;
+  return a / a;
 }
 
killedBy: Square method should return right value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 9
Received: 1
